PANDAS Dataframe

In [4]:
import numpy as np

In [5]:
import pandas as pd

In [7]:
lab = ['a','b','c']
my_list = [1,2,3]
arr = np.array(my_list)
d = {'a':1,'b':2,'c':3}

In [9]:
pd.Series(my_list,lab)

a    1
b    2
c    3
dtype: int64

In [14]:
pd.Series(arr,lab)

a    1
b    2
c    3
dtype: int32

In [15]:
ser1 =pd.Series ([1,2,3,4],['USA','UK','INDIA','JAPAN'])

In [17]:
ser2 = pd.Series([1,2,3,4],['USA','UK','south','JAPAN'])

In [20]:
ser1 + ser2

INDIA    NaN
JAPAN    8.0
UK       4.0
USA      2.0
south    NaN
dtype: float64

In [1]:
from numpy.random import randn

In [6]:
ar = np.random.seed(101)

In [9]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [11]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [13]:
#Method not recommended to call column or row
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [50]:
df[['W','X']]

          W         X
A  0.386030  2.084019
B  0.681209  1.035125
C -1.005187 -0.741790
D -1.382920  1.482495
E  0.992573  1.192241

In [52]:
type(df['W'])

pandas.core.series.Series

In [19]:
#creating new column 
df['new'] = df['W'] + df['Y']

In [22]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [20]:
#if we want to delete coulmn permanently inplace = True 
df.drop('new',axis=1,inplace=True)

In [21]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [67]:
#lable based Location
df.loc['B']

W    0.681209
X    1.035125
Y   -0.031160
Z    1.939932
Name: B, dtype: float64

In [68]:
#Index based location
df.iloc[0]

W    0.386030
X    2.084019
Y   -0.376519
Z    0.230336
Name: A, dtype: float64

In [69]:
df.loc['A','W']

0.3860303121135517

In [71]:
#Subset
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.386030 -0.376519
B  0.681209 -0.031160

In [23]:
df > 0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [24]:
dfbool = df >0

In [25]:
dfbool

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [27]:
df[dfbool]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [44]:
df
#df[df['X']>0]
df[df['Z'] >0][['X','Y']]

          X         Y
B  0.390528  0.166905
C  0.072960  0.638787
D -0.754070 -0.943406
E  1.901755  0.238127

In [49]:
# Multiple condition to be true
df
df[(df['W']>0) & (df['Y'] < 0)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [50]:
newind = 'co ny in la bn'.split()

In [53]:
df['States'] = newind

In [54]:
df.set_index('States')

               W         X         Y         Z
States
co      0.302665  1.693723 -1.706086 -1.159119
ny     -0.134841  0.390528  0.166905  0.184502
in      0.807706  0.072960  0.638787  0.329646
la     -0.497104 -0.754070 -0.943406  0.484752
bn     -0.116773  1.901755  0.238127  1.996652